#----------------------------------------输出----------------------------------
#-------（%-百分号）输出方法--------
#---------(-%s-)为字符串-------------
#---------(-%d-)为整型---------------
#---------(-%f-)为浮点数-------------

age = 18
name = "Tony"
weight = 73.7
ID = 1

print("我今年年龄%d岁" % 10)

# print("我的名字叫%s" % name)
#
# print("我的体重是%.1fkg" % weight)#-----%.1--这个是保留1位三个小数--------
#
# print("我的学号是%07d" % ID)#-----%07, 意思是print出来为7位，如果没有7位，那就0补齐
#
# print("我的名字是%s，我今年%d岁" %(name, age))
#
# print("我的名字是%s，我去年%d岁了" %(name, age-1))
#
#
# #################
# #################
# #################
# #################
#
# #----------f'{格式化字符串}'--------------
# #----------这个输出方法比上面的%-百分号的这个方法 更好一点-------
# print(f'我的名字叫{name}，然后我明年{age + 1}岁')
#
# ###############
# ###############
# ###############
#
# #-----------------------转义字符-------------------
# #-------------(\n-换行字符)-----------------------
# #-------------(\t-制表符-缩进符 大概一个Tab键(4个字符)的距离)-----------
# # \t 是用来表格对齐用的
# print("周永志\n真TM帅！")
# print("\t对对对！是真的！！")
#
#
# ###############
# ################
# ##############
# ##############
#
#
#
#
# #-----------------End输入法----------
# #作用：是将数据在后面输入
# #比如：
# print("帅到镜子都裂开了", end="哈哈哈哈哈")
# #一般情况下  这个代码显示出来的是： “帅到镜子都裂开了”
# #           然后在后面用了，end=“哈哈哈哈哈哈”这个以后
# #           就变成了 “帅到镜子都裂开了 哈哈哈哈哈哈哈”
#
#
# nums = [11,22,33,44,55]
# # 记录下标索引
# index = 0
# while index < len(nums):
#     # 通过下标获取元素
#     ret = nums[index]
#     print(ret)