#   面向对象
#   面向对象就是化简代码
#   面向对象就是将变成当成一个事物（洗衣机）

#   面向对象--类和对象
#   面向对象编程过程中，有两个重要的组成部分：   类与对象
#   编程就是设置洗衣机能够做什么事情，再用这个洗衣机
#   那么洗衣机怎么来的？
#   回答：--------工厂
#   准确回答是：  工厂工人根据设计师的功能图纸设计出来的
#   详细细节回答： 图纸 ---> 洗衣机 ---> 洗衣服

#   图纸：  用来创建洗衣机
#   在面向对象编程中：
#   “类” 就是这个图纸； “对象” 就是这个实物（洗衣机）
#   类和对象的关系： 用类去创建一个对象

#   “类” 是制造洗衣机时要用到的图纸
#   想一下，制造洗衣机用到的图纸里面都有什么？
#   回答： 长度，宽度，功能      功能： 1、放水 2、抽水 3、洗衣 4、烘干
#   这些功能只要按一下按钮，洗衣机就可以用了
#   在编程当中 这些功能就是函数
#   “类” 里面有属性和方法，就是变量和函数

#   “对象” 是类创建出来的真实存在的事物，例如:洗衣机
#   开发中，先有类，再有对象

###################################################

#   定义---类
#语法:
#   class 类名():
#       代码
#       ......

#   定义（创建）---对象
#                   对象又名实例
#语法：
#   对象名 = 类名()