#----------------------输入---------------------
#-----------------------------------------------
#-----------------------------------------------

password = input("请输入你的密码：")
print(f'你输入的密码是：{password}')


num = input("请输入你的号码:")
print(num)

print(type(num))
#---*input输出的都是字符串*---



print(type(int(num)))
#---*int()---这个是将数据类型转换成整型(string)*-----


num_1 = 77
print(type(num_1))
print(type(float(num_1)))
#----*float()---这个是将数据类型转换成小数(float)*-----
print(float(num_1))


print(type(str(num_1)))
#----*str()---这个是将数据类型转换成字符串(string)*-----



list1 = [10, 20, 30]
print(type(list1))
print(type(tuple(list1)))
#-----*tuple()-----这个是将数据类型转换成元组(tuple)*----


a1 = (100, 200, 300)
print(type(list(a1)))
#-----*list()-----这个是将数据类型转换成列表(list)*-----


A1 = "1"
A2 = "1.1"
A3 = "(10, 200, 300)"
A4 = "[10, 200, 300]"
print(type(eval(A1)))
print(type(eval(A2)))
print(type(eval(A3)))
print(type(eval(A4)))
#-----*eval()----这个是将字符串里面的任意数据类型转换成它本身的类型*-----

#-----*(乘号)---
#-----+(加号)---
#------(减号)---
#-----/(除号)---
#-----//(整除)---
#-----**(次方)---
#-----()(括号：优先算)---

#-----*复合赋值运算符*-----
#---+=(加分赋值运算符)---
#----=(减法赋值运算符)---



#-----*比较运算符*------
#-----==(相等号)-----
#-----!=(不等于号)-----
#----->(大于号)-----
#-----<(小于号)-----
#----->=(大于等于号)-----
#-----<=(小于等于号)-----


#-----*逻辑运算符*-----
a=1
b=2
c=3
#-----and(与)：都真则真
print((a < b) and (b < c))
#-----or(或)：一真则真，都假才假
print((a < b) or (b > c))
#-----not(非): 相反
print(not True)



#-------------------------------#


#-----and运算-----
print(a and b)#---只要结果有一个数为0，则结果为0，否则结果就是and最后那个数字
print(a or b)#---只有两个数为0，结果就为0，否则运算结果就是那个非0的数字








