#   导入模块

#导入模块的方式:
#           import 模块名
#           from 模块名 import 功能名
#           from 模块名 import*
#           import 模块名 as 别名
#           from 模块名 import 功能名 as 别名

#------------------------1.import 模块名-----------------------------

#语法：
#  1. 导入模块
#   import 模块名
#   import 模块名1，模块名2

#  2. 调用功能
#  模块名.功能名()

# import math
# print(math.sqrt(9))
# #sqrt 开平方的功能


#-----------------------2.from 模块名 import 功能名---------------------

#语法：
#   from 模块名 import 功能1， 功能2， 功能3...

# from math import sqrt
# print(sqrt(9))


#-----------------------3.from 模块名 import*---------------------

#语法：
#   from 模块名 import*（所有功能）

# from math import *
# print(sqrt(9))


#-----------------------4. import 模块名 as 别名---------------------
#--------------------------from 模块名 import 功能名 as 别名----------
################################################################################



#------------------------------制作模块-----------------------------------
#1.先定义模块
from hh import test
test(1, 5)







































